app/controllers/details_controller.rb

SELECT "details".* FROM "details"
---
  def index
    @details = Detail.all

SELECT "details".* FROM "details" WHERE "details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @detail= Detail.find(params[:id])

INSERT INTO "details" ("first_name", "last_name", "age", "height", "complex", "father_name", "mother_name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @detail = Detail.new(detail_params)

    if @detail.save

SELECT "details".* FROM "details" WHERE "details"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @detail = Detail.find(params[:id])

SELECT "details".* FROM "details" WHERE "details"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "details" SET "address" = ?, "updated_at" = ? WHERE "details"."id" = ?  [["address", "44,raipur"], ["updated_at", "2023-01-12 12:00:40.066698"], ["id", 8]]
---
  def update

    @detail = Detail.find(params[:id])

    if @detail.update(detail_params)

SELECT "details".* FROM "details" WHERE "details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "details" WHERE "details"."id" = ?  [["id", 1]]
---
def destroy
  @detail = Detail.find(params[:id])
  @detail.destroy